[{
  "film": {
    "title": "Hunt for the Wilderpeople",
    "overview": "Ricky is a defiant young city kid who finds himself on the run with his cantankerous foster uncle in the wild New Zealand bush. A national manhunt ensues, and the two are forced to put aside their differences and work together to survive.",
    "imageUrl": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/2wxvvnHKdZRB31Drf7PbRzPb0mR.jpg",
    "imdbScore": "7.8",
    "trailerLink": "https://www.youtube.com/watch?v=dPaU4Gymt3E"
  }
},
{
  "film": {
    "title": "Who Framed Roger Rabbit",
    "overview": "'Toon star Roger is worried that his wife Jessica is playing pattycake with someone else, so the studio hires detective Eddie Valiant to snoop on her. But the stakes are quickly raised when Marvin Acme is found dead and Roger is the prime suspect.",
    "imageUrl": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/lYfRc57Kx9VgLZ48iulu0HKnM15.jpg",
    "imdbScore": "7.4",
    "trailerLink": "https://www.youtube.com/watch?v=kYNqYC_jNAg"
  }
},
{ 
  "film": {
    "title": "Nebraska",
    "overview": "An aging, booze-addled father takes a trip from Montana to Nebraska with his estranged son in order to claim what he believes to be a million-dollar sweepstakes prize.",
    "imageUrl": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/zyG3vYWK7SwWT4bvrWeFef0J7fp.jpg",
    "imdbScore": "7.5",
    "trailerLink": "https://www.youtube.com/watch?v=YvW_DmfKfSk"
  }
},
{
  "film": {
    "title": "Harry Potter and the Order of the Phoenix",
    "overview": "Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students – dubbed 'Dumbledore's Army' – to defend themselves against the dark arts.",
    "imageUrl": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/4YnLxYLHhT4UQ8i9jxAXWy46Xuw.jpg",
    "imdbScore": "7.6",
    "trailerLink": "https://www.youtube.com/watch?v=WIj9DYJ5EKk"
  }
},
{
  "film": {
    "title": "The Assassination of Jesse James by the Coward Robert Ford",
    "overview": "Outlaw Jesse James is rumored to be the 'fastest gun in the West'. An eager recruit into James' notorious gang, Robert Ford eventually grows jealous of the famed outlaw and, when Robert and his brother sense an opportunity to kill James, their murderous action elevates their target to near mythical status.",
    "imageUrl": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/lSFYLoaL4eW7Q5VQ7SZQP4EHRCt.jpg",
    "imdbScore": "7.1",
    "trailerLink": "https://www.youtube.com/watch?v=nk0JaEwhf00"
  }
},
{
  "film": {
    "title": "Venom",
    "overview": "Investigative journalist Eddie Brock attempts a comeback following a scandal, but accidentally becomes the host of Venom, a violent, super powerful alien symbiote. Soon, he must rely on his newfound powers to protect the world from a shadowy organization looking for a symbiote of their own.",
    "imageUrl": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/2uNW4WbgBXL25BAbXGLnLqX71Sw.jpg",
    "imdbScore": "6.6",
    "trailerLink": "https://www.youtube.com/watch?v=u9Mv98Gr5pY"
  }
}
]
